ataradov/mcu-starter-projects/samg53/include/component/i2sc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2SC_SR_OFFSET                      (0x08)                                        /**<  (I2SC_SR) Status Register  Offset */

#define I2SC_SR_RXEN_Pos                    0                                              /**< (I2SC_SR) Receiver Enabled Position */
#define I2SC_SR_RXEN_Msk                    (_U_(0x1) << I2SC_SR_RXEN_Pos)                 /**< (I2SC_SR) Receiver Enabled Mask */
#define I2SC_SR_RXEN                        I2SC_SR_RXEN_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_SR_RXEN_Msk instead */
#define I2SC_SR_RXRDY_Pos                   1                                              /**< (I2SC_SR) Receive Ready Position */
#define I2SC_SR_RXRDY_Msk                   (_U_(0x1) << I2SC_SR_RXRDY_Pos)                /**< (I2SC_SR) Receive Ready Mask */
#define I2SC_SR_RXRDY                       I2SC_SR_RXRDY_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_SR_RXRDY_Msk instead */
#define I2SC_SR_RXOR_Pos                    2                                              /**< (I2SC_SR) Receive Overrun Position */
#define I2SC_SR_RXOR_Msk                    (_U_(0x1) << I2SC_SR_RXOR_Pos)                 /**< (I2SC_SR) Receive Overrun Mask */
#define I2SC_SR_RXOR                        I2SC_SR_RXOR_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_SR_RXOR_Msk instead */
#define I2SC_SR_ENDRX_Pos                   3                                              /**< (I2SC_SR) End of Receiver Transfer Position */
#define I2SC_SR_ENDRX_Msk                   (_U_(0x1) << I2SC_SR_ENDRX_Pos)                /**< (I2SC_SR) End of Receiver Transfer Mask */
#define I2SC_SR_ENDRX                       I2SC_SR_ENDRX_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_SR_ENDRX_Msk instead */
#define I2SC_SR_TXEN_Pos                    4                                              /**< (I2SC_SR) Transmitter Enabled Position */
#define I2SC_SR_TXEN_Msk                    (_U_(0x1) << I2SC_SR_TXEN_Pos)                 /**< (I2SC_SR) Transmitter Enabled Mask */
#define I2SC_SR_TXEN                        I2SC_SR_TXEN_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_SR_TXEN_Msk instead */
#define I2SC_SR_TXRDY_Pos                   5                                              /**< (I2SC_SR) Transmit Ready Position */
#define I2SC_SR_TXRDY_Msk                   (_U_(0x1) << I2SC_SR_TXRDY_Pos)                /**< (I2SC_SR) Transmit Ready Mask */
#define I2SC_SR_TXRDY                       I2SC_SR_TXRDY_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_SR_TXRDY_Msk instead */
#define I2SC_SR_TXUR_Pos                    6                                              /**< (I2SC_SR) Transmit Underrun Position */
#define I2SC_SR_TXUR_Msk                    (_U_(0x1) << I2SC_SR_TXUR_Pos)                 /**< (I2SC_SR) Transmit Underrun Mask */
#define I2SC_SR_TXUR                        I2SC_SR_TXUR_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_SR_TXUR_Msk instead */
#define I2SC_SR_ENDTX_Pos                   7                                              /**< (I2SC_SR) End of Transmitter Transfer Position */
#define I2SC_SR_ENDTX_Msk                   (_U_(0x1) << I2SC_SR_ENDTX_Pos)                /**< (I2SC_SR) End of Transmitter Transfer Mask */
#define I2SC_SR_ENDTX                       I2SC_SR_ENDTX_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_SR_ENDTX_Msk instead */
#define I2SC_SR_RXORCH_Pos                  8                                              /**< (I2SC_SR) Receive Overrun Channel Position */
#define I2SC_SR_RXORCH_Msk                  (_U_(0x3) << I2SC_SR_RXORCH_Pos)               /**< (I2SC_SR) Receive Overrun Channel Mask */
#define I2SC_SR_RXORCH(value)               (I2SC_SR_RXORCH_Msk & ((value) << I2SC_SR_RXORCH_Pos))
#define I2SC_SR_RXBUFF_Pos                  19                                             /**< (I2SC_SR) Receive Buffer Full Position */
#define I2SC_SR_RXBUFF_Msk                  (_U_(0x1) << I2SC_SR_RXBUFF_Pos)               /**< (I2SC_SR) Receive Buffer Full Mask */
#define I2SC_SR_RXBUFF                      I2SC_SR_RXBUFF_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_SR_RXBUFF_Msk instead */
#define I2SC_SR_TXURCH_Pos                  20                                             /**< (I2SC_SR) Transmit Underrun Channel Position */
#define I2SC_SR_TXURCH_Msk                  (_U_(0x3) << I2SC_SR_TXURCH_Pos)               /**< (I2SC_SR) Transmit Underrun Channel Mask */
#define I2SC_SR_TXURCH(value)               (I2SC_SR_TXURCH_Msk & ((value) << I2SC_SR_TXURCH_Pos))
#define I2SC_SR_TXBUFE_Pos                  31                                             /**< (I2SC_SR) Transmit Buffer Empty Position */
#define I2SC_SR_TXBUFE_Msk                  (_U_(0x1) << I2SC_SR_TXBUFE_Pos)               /**< (I2SC_SR) Transmit Buffer Empty Mask */
#define I2SC_SR_TXBUFE                      I2SC_SR_TXBUFE_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_SR_TXBUFE_Msk instead */
#define I2SC_SR_MASK                        _U_(0x803803FF)                                /**< \deprecated (I2SC_SR) Register MASK  (Use I2SC_SR_Msk instead)  */
#define I2SC_SR_Msk                         _U_(0x803803FF)                                /**< (I2SC_SR) Register Mask  */


/* -------- I2SC_SCR : (I2SC Offset: 0x0c) (/W 32) Status Clear Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t RXOR:1;                    /**< bit:      2  Receive Overrun Status Clear             */
    uint32_t :3;                        /**< bit:   3..5  Reserved */
    uint32_t TXUR:1;                    /**< bit:      6  Transmit Underrun Status Clear           */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t RXORCH:2;                  /**< bit:   8..9  Receive Overrun Per Channel Status Clear */
    uint32_t :10;                       /**< bit: 10..19  Reserved */
    uint32_t TXURCH:2;                  /**< bit: 20..21  Transmit Underrun Per Channel Status Clear */
    uint32_t :10;                       /**< bit: 22..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} I2SC_SCR_Type;
