ataradov/mcu-starter-projects/samg53/include/component/i2sc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2SC_IER_OFFSET                     (0x14)                                        /**<  (I2SC_IER) Interrupt Enable Register  Offset */

#define I2SC_IER_RXRDY_Pos                  1                                              /**< (I2SC_IER) Receiver Ready Interrupt Enable Position */
#define I2SC_IER_RXRDY_Msk                  (_U_(0x1) << I2SC_IER_RXRDY_Pos)               /**< (I2SC_IER) Receiver Ready Interrupt Enable Mask */
#define I2SC_IER_RXRDY                      I2SC_IER_RXRDY_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IER_RXRDY_Msk instead */
#define I2SC_IER_RXOR_Pos                   2                                              /**< (I2SC_IER) Receiver Overrun Interrupt Enable Position */
#define I2SC_IER_RXOR_Msk                   (_U_(0x1) << I2SC_IER_RXOR_Pos)                /**< (I2SC_IER) Receiver Overrun Interrupt Enable Mask */
#define I2SC_IER_RXOR                       I2SC_IER_RXOR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IER_RXOR_Msk instead */
#define I2SC_IER_ENDRX_Pos                  3                                              /**< (I2SC_IER) End of Reception Interrupt Enable Position */
#define I2SC_IER_ENDRX_Msk                  (_U_(0x1) << I2SC_IER_ENDRX_Pos)               /**< (I2SC_IER) End of Reception Interrupt Enable Mask */
#define I2SC_IER_ENDRX                      I2SC_IER_ENDRX_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IER_ENDRX_Msk instead */
#define I2SC_IER_TXRDY_Pos                  5                                              /**< (I2SC_IER) Transmit Ready Interrupt Enable Position */
#define I2SC_IER_TXRDY_Msk                  (_U_(0x1) << I2SC_IER_TXRDY_Pos)               /**< (I2SC_IER) Transmit Ready Interrupt Enable Mask */
#define I2SC_IER_TXRDY                      I2SC_IER_TXRDY_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IER_TXRDY_Msk instead */
#define I2SC_IER_TXUR_Pos                   6                                              /**< (I2SC_IER) Transmit Underflow Interrupt Enable Position */
#define I2SC_IER_TXUR_Msk                   (_U_(0x1) << I2SC_IER_TXUR_Pos)                /**< (I2SC_IER) Transmit Underflow Interrupt Enable Mask */
#define I2SC_IER_TXUR                       I2SC_IER_TXUR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IER_TXUR_Msk instead */
#define I2SC_IER_ENDTX_Pos                  7                                              /**< (I2SC_IER) End of Transmission Interrupt Enable Position */
#define I2SC_IER_ENDTX_Msk                  (_U_(0x1) << I2SC_IER_ENDTX_Pos)               /**< (I2SC_IER) End of Transmission Interrupt Enable Mask */
#define I2SC_IER_ENDTX                      I2SC_IER_ENDTX_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IER_ENDTX_Msk instead */
#define I2SC_IER_RXFULL_Pos                 19                                             /**< (I2SC_IER) Receive Buffer Full Interrupt Enable Position */
#define I2SC_IER_RXFULL_Msk                 (_U_(0x1) << I2SC_IER_RXFULL_Pos)              /**< (I2SC_IER) Receive Buffer Full Interrupt Enable Mask */
#define I2SC_IER_RXFULL                     I2SC_IER_RXFULL_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IER_RXFULL_Msk instead */
#define I2SC_IER_TXEMPTY_Pos                31                                             /**< (I2SC_IER) Transmit Buffer Empty Interrupt Enable Position */
#define I2SC_IER_TXEMPTY_Msk                (_U_(0x1) << I2SC_IER_TXEMPTY_Pos)             /**< (I2SC_IER) Transmit Buffer Empty Interrupt Enable Mask */
#define I2SC_IER_TXEMPTY                    I2SC_IER_TXEMPTY_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IER_TXEMPTY_Msk instead */
#define I2SC_IER_MASK                       _U_(0x800800EE)                                /**< \deprecated (I2SC_IER) Register MASK  (Use I2SC_IER_Msk instead)  */
#define I2SC_IER_Msk                        _U_(0x800800EE)                                /**< (I2SC_IER) Register Mask  */


/* -------- I2SC_IDR : (I2SC Offset: 0x18) (/W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :1;                        /**< bit:      0  Reserved */
    uint32_t RXRDY:1;                   /**< bit:      1  Receiver Ready Interrupt Disable         */
    uint32_t RXOR:1;                    /**< bit:      2  Receiver Overrun Interrupt Disable       */
    uint32_t ENDRX:1;                   /**< bit:      3  End of Reception Interrupt Disable       */
    uint32_t :1;                        /**< bit:      4  Reserved */
    uint32_t TXRDY:1;                   /**< bit:      5  Transmit Ready Interrupt Disable         */
    uint32_t TXUR:1;                    /**< bit:      6  Transmit Underflow Interrupt Disable     */
    uint32_t ENDTX:1;                   /**< bit:      7  End of Transmission Interrupt Disable    */
    uint32_t :11;                       /**< bit:  8..18  Reserved */
    uint32_t RXFULL:1;                  /**< bit:     19  Receive Buffer Full Interrupt Disable    */
    uint32_t :11;                       /**< bit: 20..30  Reserved */
    uint32_t TXEMPTY:1;                 /**< bit:     31  Transmit Buffer Empty Interrupt Disable  */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} I2SC_IDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

