ataradov/mcu-starter-projects/samg53/include/component/i2sc.h
#define I2SC_IDR_OFFSET                     (0x18)                                        /**<  (I2SC_IDR) Interrupt Disable Register  Offset */

#define I2SC_IDR_RXRDY_Pos                  1                                              /**< (I2SC_IDR) Receiver Ready Interrupt Disable Position */
#define I2SC_IDR_RXRDY_Msk                  (_U_(0x1) << I2SC_IDR_RXRDY_Pos)               /**< (I2SC_IDR) Receiver Ready Interrupt Disable Mask */
#define I2SC_IDR_RXRDY                      I2SC_IDR_RXRDY_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IDR_RXRDY_Msk instead */
#define I2SC_IDR_RXOR_Pos                   2                                              /**< (I2SC_IDR) Receiver Overrun Interrupt Disable Position */
#define I2SC_IDR_RXOR_Msk                   (_U_(0x1) << I2SC_IDR_RXOR_Pos)                /**< (I2SC_IDR) Receiver Overrun Interrupt Disable Mask */
#define I2SC_IDR_RXOR                       I2SC_IDR_RXOR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IDR_RXOR_Msk instead */
#define I2SC_IDR_ENDRX_Pos                  3                                              /**< (I2SC_IDR) End of Reception Interrupt Disable Position */
#define I2SC_IDR_ENDRX_Msk                  (_U_(0x1) << I2SC_IDR_ENDRX_Pos)               /**< (I2SC_IDR) End of Reception Interrupt Disable Mask */
#define I2SC_IDR_ENDRX                      I2SC_IDR_ENDRX_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IDR_ENDRX_Msk instead */
#define I2SC_IDR_TXRDY_Pos                  5                                              /**< (I2SC_IDR) Transmit Ready Interrupt Disable Position */
#define I2SC_IDR_TXRDY_Msk                  (_U_(0x1) << I2SC_IDR_TXRDY_Pos)               /**< (I2SC_IDR) Transmit Ready Interrupt Disable Mask */
#define I2SC_IDR_TXRDY                      I2SC_IDR_TXRDY_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IDR_TXRDY_Msk instead */
#define I2SC_IDR_TXUR_Pos                   6                                              /**< (I2SC_IDR) Transmit Underflow Interrupt Disable Position */
#define I2SC_IDR_TXUR_Msk                   (_U_(0x1) << I2SC_IDR_TXUR_Pos)                /**< (I2SC_IDR) Transmit Underflow Interrupt Disable Mask */
#define I2SC_IDR_TXUR                       I2SC_IDR_TXUR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IDR_TXUR_Msk instead */
#define I2SC_IDR_ENDTX_Pos                  7                                              /**< (I2SC_IDR) End of Transmission Interrupt Disable Position */
#define I2SC_IDR_ENDTX_Msk                  (_U_(0x1) << I2SC_IDR_ENDTX_Pos)               /**< (I2SC_IDR) End of Transmission Interrupt Disable Mask */
#define I2SC_IDR_ENDTX                      I2SC_IDR_ENDTX_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IDR_ENDTX_Msk instead */
#define I2SC_IDR_RXFULL_Pos                 19                                             /**< (I2SC_IDR) Receive Buffer Full Interrupt Disable Position */
#define I2SC_IDR_RXFULL_Msk                 (_U_(0x1) << I2SC_IDR_RXFULL_Pos)              /**< (I2SC_IDR) Receive Buffer Full Interrupt Disable Mask */
#define I2SC_IDR_RXFULL                     I2SC_IDR_RXFULL_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IDR_RXFULL_Msk instead */
#define I2SC_IDR_TXEMPTY_Pos                31                                             /**< (I2SC_IDR) Transmit Buffer Empty Interrupt Disable Position */
#define I2SC_IDR_TXEMPTY_Msk                (_U_(0x1) << I2SC_IDR_TXEMPTY_Pos)             /**< (I2SC_IDR) Transmit Buffer Empty Interrupt Disable Mask */
#define I2SC_IDR_TXEMPTY                    I2SC_IDR_TXEMPTY_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IDR_TXEMPTY_Msk instead */
#define I2SC_IDR_MASK                       _U_(0x800800EE)                                /**< \deprecated (I2SC_IDR) Register MASK  (Use I2SC_IDR_Msk instead)  */
#define I2SC_IDR_Msk                        _U_(0x800800EE)                                /**< (I2SC_IDR) Register Mask  */


/* -------- I2SC_IMR : (I2SC Offset: 0x1c) (R/ 32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :1;                        /**< bit:      0  Reserved */
    uint32_t RXRDY:1;                   /**< bit:      1  Receiver Ready Interrupt Disable         */
    uint32_t RXOR:1;                    /**< bit:      2  Receiver Overrun Interrupt Disable       */
    uint32_t ENDRX:1;                   /**< bit:      3  End of Reception Interrupt Disable       */
    uint32_t :1;                        /**< bit:      4  Reserved */
    uint32_t TXRDY:1;                   /**< bit:      5  Transmit Ready Interrupt Disable         */
    uint32_t TXUR:1;                    /**< bit:      6  Transmit Underflow Interrupt Disable     */
    uint32_t ENDTX:1;                   /**< bit:      7  End of Transmission Interrupt Disable    */
    uint32_t :11;                       /**< bit:  8..18  Reserved */
    uint32_t RXFULL:1;                  /**< bit:     19  Receive Buffer Full Interrupt Disable    */
    uint32_t :11;                       /**< bit: 20..30  Reserved */
    uint32_t TXEMPTY:1;                 /**< bit:     31  Transmit Buffer Empty Interrupt Disable  */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} I2SC_IMR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2SC_IMR_OFFSET                     (0x1C)                                        /**<  (I2SC_IMR) Interrupt Mask Register  Offset */

#define I2SC_IMR_RXRDY_Pos                  1                                              /**< (I2SC_IMR) Receiver Ready Interrupt Disable Position */
#define I2SC_IMR_RXRDY_Msk                  (_U_(0x1) << I2SC_IMR_RXRDY_Pos)               /**< (I2SC_IMR) Receiver Ready Interrupt Disable Mask */
#define I2SC_IMR_RXRDY                      I2SC_IMR_RXRDY_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IMR_RXRDY_Msk instead */
#define I2SC_IMR_RXOR_Pos                   2                                              /**< (I2SC_IMR) Receiver Overrun Interrupt Disable Position */
#define I2SC_IMR_RXOR_Msk                   (_U_(0x1) << I2SC_IMR_RXOR_Pos)                /**< (I2SC_IMR) Receiver Overrun Interrupt Disable Mask */
#define I2SC_IMR_RXOR                       I2SC_IMR_RXOR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IMR_RXOR_Msk instead */
#define I2SC_IMR_ENDRX_Pos                  3                                              /**< (I2SC_IMR) End of Reception Interrupt Disable Position */
#define I2SC_IMR_ENDRX_Msk                  (_U_(0x1) << I2SC_IMR_ENDRX_Pos)               /**< (I2SC_IMR) End of Reception Interrupt Disable Mask */
#define I2SC_IMR_ENDRX                      I2SC_IMR_ENDRX_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IMR_ENDRX_Msk instead */
#define I2SC_IMR_TXRDY_Pos                  5                                              /**< (I2SC_IMR) Transmit Ready Interrupt Disable Position */
#define I2SC_IMR_TXRDY_Msk                  (_U_(0x1) << I2SC_IMR_TXRDY_Pos)               /**< (I2SC_IMR) Transmit Ready Interrupt Disable Mask */
#define I2SC_IMR_TXRDY                      I2SC_IMR_TXRDY_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IMR_TXRDY_Msk instead */
#define I2SC_IMR_TXUR_Pos                   6                                              /**< (I2SC_IMR) Transmit Underflow Interrupt Disable Position */
#define I2SC_IMR_TXUR_Msk                   (_U_(0x1) << I2SC_IMR_TXUR_Pos)                /**< (I2SC_IMR) Transmit Underflow Interrupt Disable Mask */
#define I2SC_IMR_TXUR                       I2SC_IMR_TXUR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IMR_TXUR_Msk instead */
#define I2SC_IMR_ENDTX_Pos                  7                                              /**< (I2SC_IMR) End of Transmission Interrupt Disable Position */
#define I2SC_IMR_ENDTX_Msk                  (_U_(0x1) << I2SC_IMR_ENDTX_Pos)               /**< (I2SC_IMR) End of Transmission Interrupt Disable Mask */
#define I2SC_IMR_ENDTX                      I2SC_IMR_ENDTX_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IMR_ENDTX_Msk instead */
#define I2SC_IMR_RXFULL_Pos                 19                                             /**< (I2SC_IMR) Receive Buffer Full Interrupt Disable Position */
#define I2SC_IMR_RXFULL_Msk                 (_U_(0x1) << I2SC_IMR_RXFULL_Pos)              /**< (I2SC_IMR) Receive Buffer Full Interrupt Disable Mask */
#define I2SC_IMR_RXFULL                     I2SC_IMR_RXFULL_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IMR_RXFULL_Msk instead */
#define I2SC_IMR_TXEMPTY_Pos                31                                             /**< (I2SC_IMR) Transmit Buffer Empty Interrupt Disable Position */
#define I2SC_IMR_TXEMPTY_Msk                (_U_(0x1) << I2SC_IMR_TXEMPTY_Pos)             /**< (I2SC_IMR) Transmit Buffer Empty Interrupt Disable Mask */
#define I2SC_IMR_TXEMPTY                    I2SC_IMR_TXEMPTY_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_IMR_TXEMPTY_Msk instead */
#define I2SC_IMR_MASK                       _U_(0x800800EE)                                /**< \deprecated (I2SC_IMR) Register MASK  (Use I2SC_IMR_Msk instead)  */
#define I2SC_IMR_Msk                        _U_(0x800800EE)                                /**< (I2SC_IMR) Register Mask  */


