ataradov/mcu-starter-projects/samg53/include/component/i2sc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2SC_TPR_OFFSET                     (0x108)                                       /**<  (I2SC_TPR) Transmit Pointer Register  Offset */

#define I2SC_TPR_TXPTR_Pos                  0                                              /**< (I2SC_TPR) Transmit Counter Register Position */
#define I2SC_TPR_TXPTR_Msk                  (_U_(0xFFFFFFFF) << I2SC_TPR_TXPTR_Pos)        /**< (I2SC_TPR) Transmit Counter Register Mask */
#define I2SC_TPR_TXPTR(value)               (I2SC_TPR_TXPTR_Msk & ((value) << I2SC_TPR_TXPTR_Pos))
#define I2SC_TPR_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (I2SC_TPR) Register MASK  (Use I2SC_TPR_Msk instead)  */
#define I2SC_TPR_Msk                        _U_(0xFFFFFFFF)                                /**< (I2SC_TPR) Register Mask  */


/* -------- I2SC_TCR : (I2SC Offset: 0x10c) (R/W 32) Transmit Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXCTR:16;                  /**< bit:  0..15  Transmit Counter Register                */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} I2SC_TCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2SC_TCR_OFFSET                     (0x10C)                                       /**<  (I2SC_TCR) Transmit Counter Register  Offset */

#define I2SC_TCR_TXCTR_Pos                  0                                              /**< (I2SC_TCR) Transmit Counter Register Position */
#define I2SC_TCR_TXCTR_Msk                  (_U_(0xFFFF) << I2SC_TCR_TXCTR_Pos)            /**< (I2SC_TCR) Transmit Counter Register Mask */
#define I2SC_TCR_TXCTR(value)               (I2SC_TCR_TXCTR_Msk & ((value) << I2SC_TCR_TXCTR_Pos))
#define I2SC_TCR_MASK                       _U_(0xFFFF)                                    /**< \deprecated (I2SC_TCR) Register MASK  (Use I2SC_TCR_Msk instead)  */
#define I2SC_TCR_Msk                        _U_(0xFFFF)                                    /**< (I2SC_TCR) Register Mask  */


/* -------- I2SC_RNPR : (I2SC Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNPTR:32;                 /**< bit:  0..31  Receive Next Pointer                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} I2SC_RNPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2SC_RNPR_OFFSET                    (0x110)                                       /**<  (I2SC_RNPR) Receive Next Pointer Register  Offset */

#define I2SC_RNPR_RXNPTR_Pos                0                                              /**< (I2SC_RNPR) Receive Next Pointer Position */
#define I2SC_RNPR_RXNPTR_Msk                (_U_(0xFFFFFFFF) << I2SC_RNPR_RXNPTR_Pos)      /**< (I2SC_RNPR) Receive Next Pointer Mask */
#define I2SC_RNPR_RXNPTR(value)             (I2SC_RNPR_RXNPTR_Msk & ((value) << I2SC_RNPR_RXNPTR_Pos))
#define I2SC_RNPR_MASK                      _U_(0xFFFFFFFF)                                /**< \deprecated (I2SC_RNPR) Register MASK  (Use I2SC_RNPR_Msk instead)  */
#define I2SC_RNPR_Msk                       _U_(0xFFFFFFFF)                                /**< (I2SC_RNPR) Register Mask  */


/* -------- I2SC_RNCR : (I2SC Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNCTR:16;                 /**< bit:  0..15  Receive Next Counter                     */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} I2SC_RNCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2SC_RNCR_OFFSET                    (0x114)                                       /**<  (I2SC_RNCR) Receive Next Counter Register  Offset */

#define I2SC_RNCR_RXNCTR_Pos                0                                              /**< (I2SC_RNCR) Receive Next Counter Position */
#define I2SC_RNCR_RXNCTR_Msk                (_U_(0xFFFF) << I2SC_RNCR_RXNCTR_Pos)          /**< (I2SC_RNCR) Receive Next Counter Mask */
#define I2SC_RNCR_RXNCTR(value)             (I2SC_RNCR_RXNCTR_Msk & ((value) << I2SC_RNCR_RXNCTR_Pos))
#define I2SC_RNCR_MASK                      _U_(0xFFFF)                                    /**< \deprecated (I2SC_RNCR) Register MASK  (Use I2SC_RNCR_Msk instead)  */
#define I2SC_RNCR_Msk                       _U_(0xFFFF)                                    /**< (I2SC_RNCR) Register Mask  */


/* -------- I2SC_TNPR : (I2SC Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXNPTR:32;                 /**< bit:  0..31  Transmit Next Pointer                    */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} I2SC_TNPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2SC_TNPR_OFFSET                    (0x118)                                       /**<  (I2SC_TNPR) Transmit Next Pointer Register  Offset */

#define I2SC_TNPR_TXNPTR_Pos                0                                              /**< (I2SC_TNPR) Transmit Next Pointer Position */
#define I2SC_TNPR_TXNPTR_Msk                (_U_(0xFFFFFFFF) << I2SC_TNPR_TXNPTR_Pos)      /**< (I2SC_TNPR) Transmit Next Pointer Mask */
#define I2SC_TNPR_TXNPTR(value)             (I2SC_TNPR_TXNPTR_Msk & ((value) << I2SC_TNPR_TXNPTR_Pos))
#define I2SC_TNPR_MASK                      _U_(0xFFFFFFFF)                                /**< \deprecated (I2SC_TNPR) Register MASK  (Use I2SC_TNPR_Msk instead)  */
#define I2SC_TNPR_Msk                       _U_(0xFFFFFFFF)                                /**< (I2SC_TNPR) Register Mask  */


/* -------- I2SC_TNCR : (I2SC Offset: 0x11c) (R/W 32) Transmit Next Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXNCTR:16;                 /**< bit:  0..15  Transmit Counter Next                    */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} I2SC_TNCR_Type;
