ataradov/mcu-starter-projects/samg53/include/component/i2sc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2SC_PTSR_OFFSET                    (0x124)                                       /**<  (I2SC_PTSR) Transfer Status Register  Offset */

#define I2SC_PTSR_RXTEN_Pos                 0                                              /**< (I2SC_PTSR) Receiver Transfer Enable Position */
#define I2SC_PTSR_RXTEN_Msk                 (_U_(0x1) << I2SC_PTSR_RXTEN_Pos)              /**< (I2SC_PTSR) Receiver Transfer Enable Mask */
#define I2SC_PTSR_RXTEN                     I2SC_PTSR_RXTEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_PTSR_RXTEN_Msk instead */
#define I2SC_PTSR_TXTEN_Pos                 8                                              /**< (I2SC_PTSR) Transmitter Transfer Enable Position */
#define I2SC_PTSR_TXTEN_Msk                 (_U_(0x1) << I2SC_PTSR_TXTEN_Pos)              /**< (I2SC_PTSR) Transmitter Transfer Enable Mask */
#define I2SC_PTSR_TXTEN                     I2SC_PTSR_TXTEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_PTSR_TXTEN_Msk instead */
#define I2SC_PTSR_RXCBEN_Pos                16                                             /**< (I2SC_PTSR) Receiver Circular Buffer Enable Position */
#define I2SC_PTSR_RXCBEN_Msk                (_U_(0x1) << I2SC_PTSR_RXCBEN_Pos)             /**< (I2SC_PTSR) Receiver Circular Buffer Enable Mask */
#define I2SC_PTSR_RXCBEN                    I2SC_PTSR_RXCBEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_PTSR_RXCBEN_Msk instead */
#define I2SC_PTSR_TXCBEN_Pos                18                                             /**< (I2SC_PTSR) Transmitter Circular Buffer Enable Position */
#define I2SC_PTSR_TXCBEN_Msk                (_U_(0x1) << I2SC_PTSR_TXCBEN_Pos)             /**< (I2SC_PTSR) Transmitter Circular Buffer Enable Mask */
#define I2SC_PTSR_TXCBEN                    I2SC_PTSR_TXCBEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_PTSR_TXCBEN_Msk instead */
#define I2SC_PTSR_ERR_Pos                   24                                             /**< (I2SC_PTSR) Transfer Bus Error Position */
#define I2SC_PTSR_ERR_Msk                   (_U_(0x1) << I2SC_PTSR_ERR_Pos)                /**< (I2SC_PTSR) Transfer Bus Error Mask */
#define I2SC_PTSR_ERR                       I2SC_PTSR_ERR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2SC_PTSR_ERR_Msk instead */
#define I2SC_PTSR_MASK                      _U_(0x1050101)                                 /**< \deprecated (I2SC_PTSR) Register MASK  (Use I2SC_PTSR_Msk instead)  */
#define I2SC_PTSR_Msk                       _U_(0x1050101)                                 /**< (I2SC_PTSR) Register Mask  */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief I2SC hardware registers */
typedef struct {  
  __O  uint32_t I2SC_CR;        /**< (I2SC Offset: 0x00) Control Register */
  __IO uint32_t I2SC_MR;        /**< (I2SC Offset: 0x04) Mode Register */
  __I  uint32_t I2SC_SR;        /**< (I2SC Offset: 0x08) Status Register */
  __O  uint32_t I2SC_SCR;       /**< (I2SC Offset: 0x0C) Status Clear Register */
  __O  uint32_t I2SC_SSR;       /**< (I2SC Offset: 0x10) Status Set Register */
  __O  uint32_t I2SC_IER;       /**< (I2SC Offset: 0x14) Interrupt Enable Register */
  __O  uint32_t I2SC_IDR;       /**< (I2SC Offset: 0x18) Interrupt Disable Register */
  __I  uint32_t I2SC_IMR;       /**< (I2SC Offset: 0x1C) Interrupt Mask Register */
  __I  uint32_t I2SC_RHR;       /**< (I2SC Offset: 0x20) Receiver Holding Register */
  __O  uint32_t I2SC_THR;       /**< (I2SC Offset: 0x24) Transmitter Holding Register */
  RoReg8  Reserved1[0xD8];
  __IO uint32_t I2SC_RPR;       /**< (I2SC Offset: 0x100) Receive Pointer Register */
  __IO uint32_t I2SC_RCR;       /**< (I2SC Offset: 0x104) Receive Counter Register */
  __IO uint32_t I2SC_TPR;       /**< (I2SC Offset: 0x108) Transmit Pointer Register */
  __IO uint32_t I2SC_TCR;       /**< (I2SC Offset: 0x10C) Transmit Counter Register */
  __IO uint32_t I2SC_RNPR;      /**< (I2SC Offset: 0x110) Receive Next Pointer Register */
  __IO uint32_t I2SC_RNCR;      /**< (I2SC Offset: 0x114) Receive Next Counter Register */
  __IO uint32_t I2SC_TNPR;      /**< (I2SC Offset: 0x118) Transmit Next Pointer Register */
  __IO uint32_t I2SC_TNCR;      /**< (I2SC Offset: 0x11C) Transmit Next Counter Register */
  __O  uint32_t I2SC_PTCR;      /**< (I2SC Offset: 0x120) Transfer Control Register */
  __I  uint32_t I2SC_PTSR;      /**< (I2SC Offset: 0x124) Transfer Status Register */
} I2sc;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief I2SC hardware registers */
typedef struct {  
  __O  I2SC_CR_Type                   I2SC_CR;        /**< Offset: 0x00 ( /W  32) Control Register */
  __IO I2SC_MR_Type                   I2SC_MR;        /**< Offset: 0x04 (R/W  32) Mode Register */
  __I  I2SC_SR_Type                   I2SC_SR;        /**< Offset: 0x08 (R/   32) Status Register */
  __O  I2SC_SCR_Type                  I2SC_SCR;       /**< Offset: 0x0C ( /W  32) Status Clear Register */
  __O  I2SC_SSR_Type                  I2SC_SSR;       /**< Offset: 0x10 ( /W  32) Status Set Register */
  __O  I2SC_IER_Type                  I2SC_IER;       /**< Offset: 0x14 ( /W  32) Interrupt Enable Register */
  __O  I2SC_IDR_Type                  I2SC_IDR;       /**< Offset: 0x18 ( /W  32) Interrupt Disable Register */
  __I  I2SC_IMR_Type                  I2SC_IMR;       /**< Offset: 0x1C (R/   32) Interrupt Mask Register */
  __I  I2SC_RHR_Type                  I2SC_RHR;       /**< Offset: 0x20 (R/   32) Receiver Holding Register */
  __O  I2SC_THR_Type                  I2SC_THR;       /**< Offset: 0x24 ( /W  32) Transmitter Holding Register */
  __I  uint32_t                       Reserved1[54];
  __IO I2SC_RPR_Type                  I2SC_RPR;       /**< Offset: 0x100 (R/W  32) Receive Pointer Register */
  __IO I2SC_RCR_Type                  I2SC_RCR;       /**< Offset: 0x104 (R/W  32) Receive Counter Register */
  __IO I2SC_TPR_Type                  I2SC_TPR;       /**< Offset: 0x108 (R/W  32) Transmit Pointer Register */
  __IO I2SC_TCR_Type                  I2SC_TCR;       /**< Offset: 0x10C (R/W  32) Transmit Counter Register */
  __IO I2SC_RNPR_Type                 I2SC_RNPR;      /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register */
  __IO I2SC_RNCR_Type                 I2SC_RNCR;      /**< Offset: 0x114 (R/W  32) Receive Next Counter Register */
  __IO I2SC_TNPR_Type                 I2SC_TNPR;      /**< Offset: 0x118 (R/W  32) Transmit Next Pointer Register */
  __IO I2SC_TNCR_Type                 I2SC_TNCR;      /**< Offset: 0x11C (R/W  32) Transmit Next Counter Register */
  __O  I2SC_PTCR_Type                 I2SC_PTCR;      /**< Offset: 0x120 ( /W  32) Transfer Control Register */
  __I  I2SC_PTSR_Type                 I2SC_PTSR;      /**< Offset: 0x124 (R/   32) Transfer Status Register */
} I2sc;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Inter-IC Sound Controller */

#endif /* _SAMG53_I2SC_COMPONENT_H_ */
